---
kind: property
id: P:Autodesk.Revit.DB.ExportLineweightTableIterator.CurrentObject
source: html/a2230dfa-660d-d504-f08d-726df51dc44d.htm
---
# Autodesk.Revit.DB.ExportLineweightTableIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```